{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2024-10-10T19:29:11.131423Z",
     "start_time": "2024-10-10T19:29:11.127139Z"
    }
   },
   "source": [
    "from question_types.sparql import SparqlQueries\n",
    "from tabulate import tabulate\n",
    "import json\n",
    "import os"
   ],
   "outputs": [],
   "execution_count": 136
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:30:37.037959Z",
     "start_time": "2024-10-10T19:29:11.140432Z"
    }
   },
   "cell_type": "code",
   "source": "sparql = SparqlQueries(\"../dataset/14_graph.nt\")",
   "id": "b50a0b26589350a5",
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-10-10 21:29:11,142 | INFO | __init__ | \u001B[92mParsing graph\u001B[0m\n",
      "2024-10-10 21:30:37,034 | INFO | __init__ | \u001B[92mGraph parsed\u001B[0m\n"
     ]
    }
   ],
   "execution_count": 137
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:30:37.089017Z",
     "start_time": "2024-10-10T19:30:37.081871Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def execute_query(query):\n",
    "    sparql_result = sparql.execute_query(query)\n",
    "    result_lst = [\n",
    "        [str(item) for item in (row if isinstance(row, tuple) else [row])]\n",
    "        for row in sparql_result\n",
    "    ]\n",
    "    if not len(result_lst):\n",
    "        return print(\"Results were empty\")\n",
    "    headers = [f\"Col {idx}\" for idx in range(len(result_lst[0]))]\n",
    "    # print(tabulate(result_lst[:min(3, len(result_lst))], headers=headers, tablefmt=\"grid\"))\n",
    "    return result_lst"
   ],
   "id": "b10ebd824bd72d95",
   "outputs": [],
   "execution_count": 138
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:30:37.141520Z",
     "start_time": "2024-10-10T19:30:37.133355Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_all_of_type_film():\n",
    "    query = f\"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "\n",
    "        SELECT ?movie ?movieLabel WHERE {{\n",
    "            ?movie wdt:P31/wdt:P279* wd:Q11424 ;   # Match film or its subclasses\n",
    "                   rdfs:label ?movieLabel .        # Get the label of the movie\n",
    "            FILTER(LANG(?movieLabel) = \"en\")       # Only English labels\n",
    "        }}\n",
    "    \"\"\"\n",
    "    return execute_query(query)\n",
    "\n",
    "\n",
    "def get_all_of_type_actor():\n",
    "    query = f\"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "\n",
    "        SELECT ?actor ?actorLabel WHERE {{\n",
    "            ?actor wdt:P31 wd:Q5 ;  # Ensure the entity is a human\n",
    "                   wdt:P106/wdt:P279* wd:Q33999 ;  # Occupation is actor or any subclass\n",
    "                   rdfs:label ?actorLabel .  # Get actor label\n",
    "            FILTER(LANG(?actorLabel) = \"en\")  # English labels only\n",
    "        }}\n",
    "    \"\"\"\n",
    "    return execute_query(query)\n",
    "\n",
    "def get_all_of_type_film_professionals():\n",
    "    query = f\"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "\n",
    "        SELECT ?professional ?label ?roleLabel WHERE {{\n",
    "            ?professional rdfs:label ?label ;        # Get any label\n",
    "                          wdt:P31 wd:Q5 ;            # Instance of human\n",
    "                          wdt:P106 ?role .           # Occupation property\n",
    "            ?role rdfs:label ?roleLabel .            # Get role label (for debugging)\n",
    "            FILTER NOT EXISTS {{\n",
    "                ?role wdt:P279* wd:Q33999 .          # Exclude actors and subclasses\n",
    "            }}\n",
    "            FILTER(LANG(?roleLabel) = \"en\") .        # English labels for roles\n",
    "            FILTER(LANG(?label) = \"en\")              # English labels only\n",
    "        }}\n",
    "    \"\"\"\n",
    "    return execute_query(query)\n"
   ],
   "id": "f757b729e98900a0",
   "outputs": [],
   "execution_count": 139
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:30:37.154817Z",
     "start_time": "2024-10-10T19:30:37.145553Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def ensure_directory_exists(directory):\n",
    "    if not os.path.exists(directory):\n",
    "        os.makedirs(directory)\n",
    "\n",
    "def export_actor_json():\n",
    "    try:\n",
    "        ensure_directory_exists('exports')\n",
    "        actor_lst = get_all_of_type_actor()\n",
    "        db = {row[0]: row[1] for row in actor_lst}  \n",
    "        with open('exports/actors_db.json', 'w', encoding=\"utf-8\") as file:\n",
    "            json.dump(db, file, ensure_ascii=False)\n",
    "        print(f\"Actor data exported successfully. Stored {len(db)} actors.\")\n",
    "    except Exception as e:\n",
    "        print(f\"An error occurred: {e}\")\n",
    "\n",
    "def export_professionals_json():\n",
    "    try:\n",
    "        ensure_directory_exists('exports')\n",
    "        actor_lst = get_all_of_type_film_professionals()\n",
    "        db = {row[0]: (row[1], row[2]) for row in actor_lst}  \n",
    "        with open('exports/professionals_db.json', 'w', encoding=\"utf-8\") as file:\n",
    "            json.dump(db, file, ensure_ascii=False)\n",
    "        print(f\"Actor data exported successfully. Stored {len(db)} actors.\")\n",
    "    except Exception as e:\n",
    "        print(f\"An error occurred: {e}\")\n",
    "\n",
    "def export_film_json():\n",
    "    try:\n",
    "        ensure_directory_exists('exports')\n",
    "        film_lst = get_all_of_type_film()\n",
    "        db = {row[0]: row[1] for row in film_lst}\n",
    "        with open('exports/film_db.json', 'w', encoding=\"utf-8\") as file:\n",
    "            json.dump(db, file, ensure_ascii=False)\n",
    "        print(f\"Film data exported successfully. Stored {len(db)} films.\")\n",
    "    except Exception as e:\n",
    "        print(f\"An error occurred: {e}\")\n"
   ],
   "id": "4054fdcc5ea504d",
   "outputs": [],
   "execution_count": 140
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:30:37.194506Z",
     "start_time": "2024-10-10T19:30:37.184549Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def search_anything_by_name(name: str):\n",
    "    query = f\"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "\n",
    "        SELECT ?entity ?label ?description WHERE {{\n",
    "            ?entity rdfs:label ?label .        # Get any entity with a label\n",
    "            OPTIONAL {{ ?entity schema:description ?description FILTER(LANG(?description) = \"en\") }}  # Get descriptions if available\n",
    "            FILTER(CONTAINS(LCASE(?label), LCASE(\"{name}\"))) .  # Match name substring, case-insensitive\n",
    "            FILTER(LANG(?label) = \"en\")  # English labels only\n",
    "        }}\n",
    "        LIMIT 10\n",
    "    \"\"\"\n",
    "    return execute_query(query)\n",
    "\n",
    "def get_all_predicates_by_id(entity_id: str) -> list:\n",
    "    #[[predicate_id, predicate_name, object_id, object_name]]\n",
    "    query = f\"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "        \n",
    "        SELECT ?predicate ?predicateLabel ?object ?objectLabel WHERE {{\n",
    "            wd:{entity_id} ?predicate ?object .  # Retrieve all properties and values for the given entity\n",
    "            OPTIONAL {{ ?predicate rdfs:label ?predicateLabel . FILTER(LANG(?predicateLabel) = \"en\") }}  # Get predicate label\n",
    "            OPTIONAL {{ ?object rdfs:label ?objectLabel . FILTER(LANG(?objectLabel) = \"en\") }}           # Get object label\n",
    "        }}\n",
    "        ORDER BY ?predicate\n",
    "    \"\"\"\n",
    "    return execute_query(query)\n",
    "\n",
    "def id_to_predicate_dict(ids: list) -> dict:\n",
    "    all_predicates = dict()\n",
    "    for id_elem in ids:\n",
    "        actor_id = id_elem[0].split(\"/\")[-1]\n",
    "        predicate_obj = get_all_predicates_by_id(actor_id)\n",
    "        \n",
    "        if actor_id not in all_predicates:\n",
    "            all_predicates[actor_id] = {\"entity_name\":id_elem[1]}\n",
    "        else:\n",
    "            continue\n",
    "        \n",
    "        for pred in predicate_obj:\n",
    "            if pred[3] == \"None\":\n",
    "                continue\n",
    "                \n",
    "            if pred[1] not in all_predicates[actor_id]:\n",
    "                all_predicates[actor_id][pred[1]] = []\n",
    "            \n",
    "            all_predicates[actor_id][pred[1]].append(pred[3])\n",
    "    return all_predicates\n",
    "\n",
    "def actor_to_predicate(actor_name):\n",
    "    #[[actor_id, actor_name, imdb_id]]\n",
    "    possible_ids = execute_query(f\"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "\n",
    "        SELECT ?actor ?actorLabel WHERE {{\n",
    "            ?actor wdt:P31 wd:Q5 ;                         # Ensure the entity is a human\n",
    "                   wdt:P106/wdt:P279* wd:Q33999 ;          # Occupation is actor or any subclass\n",
    "                   rdfs:label ?actorLabel .                # Get actor label\n",
    "\n",
    "            FILTER(CONTAINS(LCASE(?actorLabel), LCASE(\"{actor_name}\"))) .  # Match name substring in any label\n",
    "            FILTER(LANG(?actorLabel) = \"en\")  # English labels only\n",
    "        }}\n",
    "    \"\"\")\n",
    "    \n",
    "    all_predicates = id_to_predicate_dict(possible_ids)\n",
    "    print(json.dumps(all_predicates, indent=2, ensure_ascii=False))\n",
    "        \n",
    "def movie_to_predicate(movie_name: str) -> str:\n",
    "    possible_ids = execute_query(f\"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "\n",
    "        SELECT ?movie ?movieLabel WHERE {{\n",
    "            ?movie wdt:P31/wdt:P279* wd:Q11424 ;   # Match film or its subclasses\n",
    "                   rdfs:label ?movieLabel .        # Get the label of the movie\n",
    "            FILTER(CONTAINS(LCASE(?movieLabel), LCASE(\"{movie_name}\"))) .  # Substring match\n",
    "            FILTER(LANG(?movieLabel) = \"en\")       # Only English labels\n",
    "        }}\n",
    "    \"\"\")\n",
    "    all_predicates = id_to_predicate_dict(possible_ids)\n",
    "    print(json.dumps(all_predicates, indent=2, ensure_ascii=False))\n",
    "\n",
    "def professional_to_predicate(professional_name: str) -> dict:\n",
    "    possible_ids = execute_query(\n",
    "        f\"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "\n",
    "        SELECT ?professional ?label ?roleLabel WHERE {{\n",
    "            ?professional rdfs:label ?label ;        # Get any label\n",
    "                          wdt:P31 wd:Q5 ;            # Instance of human\n",
    "                          wdt:P106 ?role .           # Occupation property\n",
    "            ?role rdfs:label ?roleLabel .            # Get role label (for debugging)\n",
    "            FILTER NOT EXISTS {{\n",
    "                ?role wdt:P279* wd:Q33999 .          # Exclude actors and subclasses\n",
    "            }}\n",
    "            FILTER(LANG(?roleLabel) = \"en\") .        # English labels for roles\n",
    "            FILTER(CONTAINS(LCASE(?label), LCASE(\"{professional_name}\"))) .  # Match name substring in any label\n",
    "            FILTER(LANG(?label) = \"en\")              # English labels only\n",
    "        }}\n",
    "        \"\"\"\n",
    "    )\n",
    "    all_predicates = id_to_predicate_dict(possible_ids)\n",
    "    print(json.dumps(all_predicates, indent=2, ensure_ascii=False))\n",
    "    \n",
    "def get_imdb_id_by_name(name: str) -> str:\n",
    "    possible_ids = execute_query(f\"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "        PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "\n",
    "        SELECT ?imdbId ?entity  WHERE {{\n",
    "            ?entity rdfs:label ?label ;\n",
    "                    wdt:P345 ?imdbId .                # IMDb ID property\n",
    "            FILTER(CONTAINS(LCASE(?label), LCASE(\"{name}\"))) .  # Match name substring\n",
    "            FILTER(LANG(?label) = \"en\")               # English labels only\n",
    "        }}\n",
    "        LIMIT 1\n",
    "    \"\"\")\n",
    "    print(possible_ids)\n"
   ],
   "id": "c9761e3fc3602918",
   "outputs": [],
   "execution_count": 141
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:30:54.681148Z",
     "start_time": "2024-10-10T19:30:37.217187Z"
    }
   },
   "cell_type": "code",
   "source": [
    "export_actor_json()\n",
    "export_film_json()\n",
    "export_professionals_json()"
   ],
   "id": "a091f005723c676c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Actor data exported successfully. Stored 56373 actors.\n",
      "Film data exported successfully. Stored 27117 films.\n",
      "Actor data exported successfully. Stored 17992 actors.\n"
     ]
    }
   ],
   "execution_count": 142
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:30:59.917781Z",
     "start_time": "2024-10-10T19:30:54.697420Z"
    }
   },
   "cell_type": "code",
   "source": "actor_to_predicate(\"Brad Pitt\")",
   "id": "d3c7346ed2492a86",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\n",
      "  \"Q35332\": {\n",
      "    \"entity_name\": \"Brad Pitt\",\n",
      "    \"native language\": [\n",
      "      \"American English\"\n",
      "    ],\n",
      "    \"occupation\": [\n",
      "      \"executive producer\",\n",
      "      \"actor\",\n",
      "      \"model\"\n",
      "    ],\n",
      "    \"student of\": [\n",
      "      \"Roy London\"\n",
      "    ],\n",
      "    \"described by source\": [\n",
      "      \"Obalky knih.cz\"\n",
      "    ],\n",
      "    \"nominated for\": [\n",
      "      \"Academy Award for Best Picture\",\n",
      "      \"Academy Award for Best Actor\",\n",
      "      \"Academy Award for Best Supporting Actor\",\n",
      "      \"European Film Award – People's Choice Award for Best European Film\"\n",
      "    ],\n",
      "    \"languages spoken, written or signed\": [\n",
      "      \"English\"\n",
      "    ],\n",
      "    \"award received\": [\n",
      "      \"Golden Globe Award\",\n",
      "      \"Academy Award for Best Picture\",\n",
      "      \"Academy Award for Best Supporting Actor\",\n",
      "      \"Saturn Award for Best Supporting Actor\",\n",
      "      \"New York Film Critics Circle Award for Best Actor\",\n",
      "      \"National Society of Film Critics Award for Best Actor\",\n",
      "      \"Rembrandt Award\",\n",
      "      \"Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture\",\n",
      "      \"Golden Globe Award for Best Supporting Actor – Motion Picture\",\n",
      "      \"British Academy Film Awards\",\n",
      "      \"Boston Society of Film Critics Award for Best Actor\",\n",
      "      \"Broadcast Film Critics Association Award for Best Cast\"\n",
      "    ],\n",
      "    \"owner of\": [\n",
      "      \"Plan B Entertainment\"\n",
      "    ],\n",
      "    \"spouse\": [\n",
      "      \"Angelina Jolie\",\n",
      "      \"Jennifer Aniston\"\n",
      "    ],\n",
      "    \"country of citizenship\": [\n",
      "      \"United States of America\"\n",
      "    ],\n",
      "    \"instance of\": [\n",
      "      \"human\"\n",
      "    ],\n",
      "    \"unmarried partner\": [\n",
      "      \"Angelina Jolie\",\n",
      "      \"Jennifer Aniston\",\n",
      "      \"Gwyneth Paltrow\"\n",
      "    ],\n",
      "    \"residence\": [\n",
      "      \"Los Angeles\"\n",
      "    ]\n",
      "  }\n",
      "}\n"
     ]
    }
   ],
   "execution_count": 143
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:31:02.135660Z",
     "start_time": "2024-10-10T19:30:59.961300Z"
    }
   },
   "cell_type": "code",
   "source": "movie_to_predicate(\"Transformers\")",
   "id": "34fdce907e9cd8fc",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\n",
      "  \"Q24251026\": {\n",
      "    \"entity_name\": \"Transformers: The Last Knight\",\n",
      "    \"film editor\": [\n",
      "      \"Roger Barton\"\n",
      "    ],\n",
      "    \"genre\": [\n",
      "      \"science fiction action film\"\n",
      "    ],\n",
      "    \"executive producer\": [\n",
      "      \"Steven Spielberg\"\n",
      "    ],\n",
      "    \"takes place in fictional universe\": [\n",
      "      \"Transformers universe\"\n",
      "    ],\n",
      "    \"follows\": [\n",
      "      \"Transformers: Age of Extinction\"\n",
      "    ],\n",
      "    \"followed by\": [\n",
      "      \"Bumblebee\"\n",
      "    ],\n",
      "    \"cast member\": [\n",
      "      \"Liam Garrigan\",\n",
      "      \"Mark Wahlberg\",\n",
      "      \"Laura Haddock\",\n",
      "      \"Josh Duhamel\",\n",
      "      \"Isabela Moner\",\n",
      "      \"Jerrod Carmichael\",\n",
      "      \"Stanley Tucci\",\n",
      "      \"John Turturro\",\n",
      "      \"Mitch Pileggi\",\n",
      "      \"Tyrese Gibson\",\n",
      "      \"Santiago Cabrera\",\n",
      "      \"Anthony Hopkins\"\n",
      "    ],\n",
      "    \"MPAA film rating\": [\n",
      "      \"PG-13\"\n",
      "    ],\n",
      "    \"part of the series\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"uses\": [\n",
      "      \"product placement\"\n",
      "    ],\n",
      "    \"NMHH film rating\": [\n",
      "      \"Category III\"\n",
      "    ],\n",
      "    \"BBFC rating\": [\n",
      "      \"12A certificate\"\n",
      "    ],\n",
      "    \"Kijkwijzer rating\": [\n",
      "      \"12\"\n",
      "    ],\n",
      "    \"production company\": [\n",
      "      \"Paramount Pictures\"\n",
      "    ],\n",
      "    \"CNC film rating (France)\": [\n",
      "      \"no age restriction\"\n",
      "    ],\n",
      "    \"instance of\": [\n",
      "      \"film\",\n",
      "      \"3D film\"\n",
      "    ],\n",
      "    \"ClassInd rating\": [\n",
      "      \"12\"\n",
      "    ],\n",
      "    \"ICAA rating\": [\n",
      "      \"not recommended for children under 12\"\n",
      "    ],\n",
      "    \"CNC film rating (Romania)\": [\n",
      "      \"A.P. - 12\"\n",
      "    ],\n",
      "    \"INCAA film rating\": [\n",
      "      \"+13\"\n",
      "    ],\n",
      "    \"director of photography\": [\n",
      "      \"Jonathan Sela\"\n",
      "    ],\n",
      "    \"original language of film or TV show\": [\n",
      "      \"English\"\n",
      "    ],\n",
      "    \"KMRB film rating\": [\n",
      "      \"12\"\n",
      "    ],\n",
      "    \"RTC film rating\": [\n",
      "      \"B\"\n",
      "    ],\n",
      "    \"distribution format\": [\n",
      "      \"video on demand\"\n",
      "    ],\n",
      "    \"FPB rating\": [\n",
      "      \"10-12 PG\"\n",
      "    ],\n",
      "    \"color\": [\n",
      "      \"color\"\n",
      "    ],\n",
      "    \"country of origin\": [\n",
      "      \"United States of America\"\n",
      "    ],\n",
      "    \"assessment\": [\n",
      "      \"Bechdel test\"\n",
      "    ],\n",
      "    \"IMDA rating\": [\n",
      "      \"PG13\"\n",
      "    ],\n",
      "    \"director\": [\n",
      "      \"Michael Bay\"\n",
      "    ],\n",
      "    \"screenwriter\": [\n",
      "      \"Art Marcum\"\n",
      "    ],\n",
      "    \"Medierådet rating\": [\n",
      "      \"For ages 11 and up\"\n",
      "    ],\n",
      "    \"RCQ classification\": [\n",
      "      \"G\"\n",
      "    ],\n",
      "    \"distributed by\": [\n",
      "      \"UIP-Dunafilm\",\n",
      "      \"Paramount Pictures\",\n",
      "      \"Hulu\"\n",
      "    ],\n",
      "    \"IFCO rating\": [\n",
      "      \"12A\"\n",
      "    ],\n",
      "    \"narrative location\": [\n",
      "      \"Washington, D.C.\"\n",
      "    ],\n",
      "    \"filming location\": [\n",
      "      \"Arizona\"\n",
      "    ]\n",
      "  },\n",
      "  \"Q6151665\": {\n",
      "    \"entity_name\": \"Transformers: Age of Extinction\",\n",
      "    \"film editor\": [\n",
      "      \"William Goldenberg\"\n",
      "    ],\n",
      "    \"genre\": [\n",
      "      \"action film\",\n",
      "      \"science fiction film\"\n",
      "    ],\n",
      "    \"executive producer\": [\n",
      "      \"Steven Spielberg\"\n",
      "    ],\n",
      "    \"takes place in fictional universe\": [\n",
      "      \"Transformers universe\"\n",
      "    ],\n",
      "    \"based on\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"follows\": [\n",
      "      \"Transformers: Dark of the Moon\"\n",
      "    ],\n",
      "    \"followed by\": [\n",
      "      \"Transformers: The Last Knight\"\n",
      "    ],\n",
      "    \"cast member\": [\n",
      "      \"T.J. Miller\",\n",
      "      \"Mark Wahlberg\",\n",
      "      \"Kelsey Grammer\",\n",
      "      \"Robert Foxworth\",\n",
      "      \"Ken Watanabe\",\n",
      "      \"John Goodman\",\n",
      "      \"Stanley Tucci\",\n",
      "      \"Sophia Myles\",\n",
      "      \"Nicola Peltz\",\n",
      "      \"Li Bingbing\",\n",
      "      \"Jack Reynor\",\n",
      "      \"Frank Welker\",\n",
      "      \"Cleo King\",\n",
      "      \"John DiMaggio\",\n",
      "      \"Han Geng\",\n",
      "      \"Titus Welliver\",\n",
      "      \"Charles Parnell\",\n",
      "      \"Michael Bay\",\n",
      "      \"Peter Cullen\"\n",
      "    ],\n",
      "    \"part of the series\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"FSK film rating\": [\n",
      "      \"FSK 12\"\n",
      "    ],\n",
      "    \"NMHH film rating\": [\n",
      "      \"Category III\"\n",
      "    ],\n",
      "    \"Kijkwijzer rating\": [\n",
      "      \"12\"\n",
      "    ],\n",
      "    \"production company\": [\n",
      "      \"Paramount Pictures\",\n",
      "      \"Hasbro\"\n",
      "    ],\n",
      "    \"instance of\": [\n",
      "      \"film\",\n",
      "      \"3D film\"\n",
      "    ],\n",
      "    \"ICAA rating\": [\n",
      "      \"not recommended for children under 12\"\n",
      "    ],\n",
      "    \"CNC film rating (Romania)\": [\n",
      "      \"A.P. - 12\"\n",
      "    ],\n",
      "    \"director of photography\": [\n",
      "      \"Amir Mokri\"\n",
      "    ],\n",
      "    \"original language of film or TV show\": [\n",
      "      \"English\"\n",
      "    ],\n",
      "    \"JMK film rating\": [\n",
      "      \"free from 12 years\"\n",
      "    ],\n",
      "    \"RTC film rating\": [\n",
      "      \"B\"\n",
      "    ],\n",
      "    \"distribution format\": [\n",
      "      \"video on demand\"\n",
      "    ],\n",
      "    \"color\": [\n",
      "      \"color\"\n",
      "    ],\n",
      "    \"country of origin\": [\n",
      "      \"United States of America\"\n",
      "    ],\n",
      "    \"assessment\": [\n",
      "      \"Bechdel test\"\n",
      "    ],\n",
      "    \"director\": [\n",
      "      \"Michael Bay\"\n",
      "    ],\n",
      "    \"screenwriter\": [\n",
      "      \"Ehren Kruger\"\n",
      "    ],\n",
      "    \"Medierådet rating\": [\n",
      "      \"For ages 11 and up\"\n",
      "    ],\n",
      "    \"voice actor\": [\n",
      "      \"Melanie Hinze\"\n",
      "    ],\n",
      "    \"distributed by\": [\n",
      "      \"UIP-Dunafilm\",\n",
      "      \"Paramount Pictures\",\n",
      "      \"FandangoNow\",\n",
      "      \"Netflix\"\n",
      "    ],\n",
      "    \"narrative location\": [\n",
      "      \"Chicago\",\n",
      "      \"Texas\",\n",
      "      \"Hong Kong\"\n",
      "    ],\n",
      "    \"filming location\": [\n",
      "      \"Detroit\",\n",
      "      \"Chicago\",\n",
      "      \"Los Angeles\",\n",
      "      \"Utah\",\n",
      "      \"Hong Kong\",\n",
      "      \"Beijing\"\n",
      "    ]\n",
      "  },\n",
      "  \"Q232774\": {\n",
      "    \"entity_name\": \"Transformers: Dark of the Moon\",\n",
      "    \"film editor\": [\n",
      "      \"Roger Barton\"\n",
      "    ],\n",
      "    \"genre\": [\n",
      "      \"action film\",\n",
      "      \"alien invasion\",\n",
      "      \"thriller film\",\n",
      "      \"science fiction film\"\n",
      "    ],\n",
      "    \"nominated for\": [\n",
      "      \"Academy Award for Best Visual Effects\",\n",
      "      \"Academy Award for Best Sound Editing\",\n",
      "      \"Academy Award for Best Sound\"\n",
      "    ],\n",
      "    \"executive producer\": [\n",
      "      \"Steven Spielberg\"\n",
      "    ],\n",
      "    \"takes place in fictional universe\": [\n",
      "      \"Transformers universe\"\n",
      "    ],\n",
      "    \"based on\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"follows\": [\n",
      "      \"Transformers: Revenge of the Fallen\"\n",
      "    ],\n",
      "    \"followed by\": [\n",
      "      \"Transformers: Age of Extinction\"\n",
      "    ],\n",
      "    \"cast member\": [\n",
      "      \"Elya Baskin\",\n",
      "      \"Keith Szarabajka\",\n",
      "      \"Leonard Nimoy\",\n",
      "      \"John Malkovich\",\n",
      "      \"Shia LaBeouf\",\n",
      "      \"Josh Duhamel\",\n",
      "      \"Frances McDormand\",\n",
      "      \"Robert Foxworth\",\n",
      "      \"Rosie Huntington-Whiteley\",\n",
      "      \"Patrick Dempsey\",\n",
      "      \"Buzz Aldrin\",\n",
      "      \"John Turturro\",\n",
      "      \"Charlie Adler\",\n",
      "      \"Jess Harnell\",\n",
      "      \"Julie White\",\n",
      "      \"Frank Welker\",\n",
      "      \"Tom Kenny\",\n",
      "      \"Tyrese Gibson\",\n",
      "      \"Alan Tudyk\",\n",
      "      \"George Coe\",\n",
      "      \"Hugo Weaving\",\n",
      "      \"Ken Jeong\",\n",
      "      \"James Remar\",\n",
      "      \"Francesco Quinn\",\n",
      "      \"Glenn Morshower\",\n",
      "      \"Kevin Dunn\",\n",
      "      \"Peter Cullen\",\n",
      "      \"Inna Korobkina\"\n",
      "    ],\n",
      "    \"part of the series\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"FSK film rating\": [\n",
      "      \"FSK 12\"\n",
      "    ],\n",
      "    \"aspect ratio\": [\n",
      "      \"2.35:1\"\n",
      "    ],\n",
      "    \"costume designer\": [\n",
      "      \"Deborah Lynn Scott\"\n",
      "    ],\n",
      "    \"production designer\": [\n",
      "      \"Nigel Phelps\"\n",
      "    ],\n",
      "    \"production company\": [\n",
      "      \"Paramount Pictures\",\n",
      "      \"di Bonaventura Pictures\",\n",
      "      \"Hasbro\"\n",
      "    ],\n",
      "    \"Filmiroda rating\": [\n",
      "      \"Category III\"\n",
      "    ],\n",
      "    \"instance of\": [\n",
      "      \"film\",\n",
      "      \"3D film\"\n",
      "    ],\n",
      "    \"CNC film rating (Romania)\": [\n",
      "      \"A.P. - 12\"\n",
      "    ],\n",
      "    \"director of photography\": [\n",
      "      \"Amir Mokri\"\n",
      "    ],\n",
      "    \"original language of film or TV show\": [\n",
      "      \"English\"\n",
      "    ],\n",
      "    \"JMK film rating\": [\n",
      "      \"free from 12 years\"\n",
      "    ],\n",
      "    \"RTC film rating\": [\n",
      "      \"B\"\n",
      "    ],\n",
      "    \"distribution format\": [\n",
      "      \"video on demand\"\n",
      "    ],\n",
      "    \"color\": [\n",
      "      \"color\"\n",
      "    ],\n",
      "    \"country of origin\": [\n",
      "      \"United States of America\"\n",
      "    ],\n",
      "    \"assessment\": [\n",
      "      \"reverse Bechdel Test\",\n",
      "      \"Bechdel test\"\n",
      "    ],\n",
      "    \"director\": [\n",
      "      \"Michael Bay\"\n",
      "    ],\n",
      "    \"screenwriter\": [\n",
      "      \"Ehren Kruger\"\n",
      "    ],\n",
      "    \"Medierådet rating\": [\n",
      "      \"For ages 11 and up\"\n",
      "    ],\n",
      "    \"distributed by\": [\n",
      "      \"UIP-Dunafilm\",\n",
      "      \"Paramount Pictures\",\n",
      "      \"Netflix\"\n",
      "    ],\n",
      "    \"form of creative work\": [\n",
      "      \"soundtrack\"\n",
      "    ],\n",
      "    \"narrative location\": [\n",
      "      \"Chicago\",\n",
      "      \"Ukraine\",\n",
      "      \"Washington, D.C.\",\n",
      "      \"Florida\",\n",
      "      \"Hong Kong\"\n",
      "    ],\n",
      "    \"filming location\": [\n",
      "      \"Chicago\",\n",
      "      \"Russia\",\n",
      "      \"Long Beach\",\n",
      "      \"Los Angeles\",\n",
      "      \"Florida\",\n",
      "      \"Hong Kong\"\n",
      "    ],\n",
      "    \"main subject\": [\n",
      "      \"alien invasion\"\n",
      "    ]\n",
      "  },\n",
      "  \"Q171453\": {\n",
      "    \"entity_name\": \"Transformers\",\n",
      "    \"film editor\": [\n",
      "      \"Paul Rubell\"\n",
      "    ],\n",
      "    \"genre\": [\n",
      "      \"action film\",\n",
      "      \"alien invasion\",\n",
      "      \"science fiction film\"\n",
      "    ],\n",
      "    \"nominated for\": [\n",
      "      \"Academy Award for Best Visual Effects\",\n",
      "      \"Academy Award for Best Sound Editing\",\n",
      "      \"Academy Award for Best Sound\"\n",
      "    ],\n",
      "    \"executive producer\": [\n",
      "      \"Steven Spielberg\"\n",
      "    ],\n",
      "    \"takes place in fictional universe\": [\n",
      "      \"Transformers universe\"\n",
      "    ],\n",
      "    \"based on\": [\n",
      "      \"The Transformers\"\n",
      "    ],\n",
      "    \"followed by\": [\n",
      "      \"Transformers: Revenge of the Fallen\"\n",
      "    ],\n",
      "    \"cast member\": [\n",
      "      \"C. J. Thomason\",\n",
      "      \"John Robinson\",\n",
      "      \"Zack Ward\",\n",
      "      \"Michael Shamus Wiles\",\n",
      "      \"Jon Voight\",\n",
      "      \"Bernie Mac\",\n",
      "      \"Shia LaBeouf\",\n",
      "      \"Josh Duhamel\",\n",
      "      \"Robert Foxworth\",\n",
      "      \"Amaury Nolasco\",\n",
      "      \"Odette Annable\",\n",
      "      \"Rachael Taylor\",\n",
      "      \"John Turturro\",\n",
      "      \"Jess Harnell\",\n",
      "      \"Julie White\",\n",
      "      \"Samantha Smith\",\n",
      "      \"Tyrese Gibson\",\n",
      "      \"Anthony Anderson\",\n",
      "      \"Michael O'Neill\",\n",
      "      \"Tom Everett\",\n",
      "      \"Andy Milder\",\n",
      "      \"Hugo Weaving\",\n",
      "      \"Brian Stepanek\",\n",
      "      \"Steven Ford\",\n",
      "      \"Frederic Doss\",\n",
      "      \"Glenn Morshower\",\n",
      "      \"Michael Bay\",\n",
      "      \"W. Morgan Sheppard\",\n",
      "      \"Travis Van Winkle\",\n",
      "      \"Kevin Dunn\",\n",
      "      \"Chris Ellis\",\n",
      "      \"Darius McCrary\",\n",
      "      \"Michelle Pierce\",\n",
      "      \"Mark Ryan\",\n",
      "      \"Megan Fox\",\n",
      "      \"Peter Cullen\",\n",
      "      \"Colton Haynes\"\n",
      "    ],\n",
      "    \"MPAA film rating\": [\n",
      "      \"PG-13\"\n",
      "    ],\n",
      "    \"part of the series\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"FSK film rating\": [\n",
      "      \"FSK 12\"\n",
      "    ],\n",
      "    \"production company\": [\n",
      "      \"di Bonaventura Pictures\",\n",
      "      \"DreamWorks\",\n",
      "      \"Hasbro\"\n",
      "    ],\n",
      "    \"Filmiroda rating\": [\n",
      "      \"Category II\"\n",
      "    ],\n",
      "    \"CNC film rating (France)\": [\n",
      "      \"no age restriction\"\n",
      "    ],\n",
      "    \"instance of\": [\n",
      "      \"film\"\n",
      "    ],\n",
      "    \"director of photography\": [\n",
      "      \"Mitchell Amundsen\"\n",
      "    ],\n",
      "    \"original language of film or TV show\": [\n",
      "      \"English\"\n",
      "    ],\n",
      "    \"JMK film rating\": [\n",
      "      \"free from 12 years\"\n",
      "    ],\n",
      "    \"distribution format\": [\n",
      "      \"video on demand\"\n",
      "    ],\n",
      "    \"color\": [\n",
      "      \"color\"\n",
      "    ],\n",
      "    \"country of origin\": [\n",
      "      \"United States of America\"\n",
      "    ],\n",
      "    \"assessment\": [\n",
      "      \"reverse Bechdel Test\",\n",
      "      \"Bechdel test\"\n",
      "    ],\n",
      "    \"director\": [\n",
      "      \"Michael Bay\"\n",
      "    ],\n",
      "    \"screenwriter\": [\n",
      "      \"Alex Kurtzman\",\n",
      "      \"Roberto Orci\"\n",
      "    ],\n",
      "    \"Medierådet rating\": [\n",
      "      \"For ages 11 and up\"\n",
      "    ],\n",
      "    \"distributed by\": [\n",
      "      \"UIP-Dunafilm\",\n",
      "      \"Paramount Pictures\",\n",
      "      \"Netflix\"\n",
      "    ],\n",
      "    \"narrative location\": [\n",
      "      \"Washington, D.C.\",\n",
      "      \"Los Angeles\"\n",
      "    ],\n",
      "    \"filming location\": [\n",
      "      \"New Mexico\",\n",
      "      \"San Diego\",\n",
      "      \"Long Beach\",\n",
      "      \"Los Angeles\"\n",
      "    ],\n",
      "    \"main subject\": [\n",
      "      \"alien invasion\"\n",
      "    ]\n",
      "  },\n",
      "  \"Q191100\": {\n",
      "    \"entity_name\": \"Transformers: Revenge of the Fallen\",\n",
      "    \"film editor\": [\n",
      "      \"Roger Barton\"\n",
      "    ],\n",
      "    \"genre\": [\n",
      "      \"action film\",\n",
      "      \"science fiction film\"\n",
      "    ],\n",
      "    \"nominated for\": [\n",
      "      \"Academy Award for Best Sound\"\n",
      "    ],\n",
      "    \"executive producer\": [\n",
      "      \"Steven Spielberg\"\n",
      "    ],\n",
      "    \"takes place in fictional universe\": [\n",
      "      \"Transformers universe\"\n",
      "    ],\n",
      "    \"based on\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"follows\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"followed by\": [\n",
      "      \"Transformers: Dark of the Moon\"\n",
      "    ],\n",
      "    \"cast member\": [\n",
      "      \"John Benjamin Hickey\",\n",
      "      \"Matthew Marsden\",\n",
      "      \"Cas Anvar\",\n",
      "      \"Shia LaBeouf\",\n",
      "      \"Josh Duhamel\",\n",
      "      \"Isabel Lucas\",\n",
      "      \"John Turturro\",\n",
      "      \"Julie White\",\n",
      "      \"Aaron Lustig\",\n",
      "      \"America Olivo\",\n",
      "      \"Michael York\",\n",
      "      \"Tyrese Gibson\",\n",
      "      \"Keith Stallworth\",\n",
      "      \"Rainn Wilson\",\n",
      "      \"Tony Todd\",\n",
      "      \"James Harvey Ward\",\n",
      "      \"Hugo Weaving\",\n",
      "      \"Deep Roy\",\n",
      "      \"Kevin Michael Richardson\",\n",
      "      \"Glenn Morshower\",\n",
      "      \"Aaron Hill\",\n",
      "      \"Kevin Dunn\",\n",
      "      \"Mark Ryan\",\n",
      "      \"Megan Fox\",\n",
      "      \"Peter Cullen\",\n",
      "      \"Michael Papajohn\",\n",
      "      \"Ramón Rodríguez\"\n",
      "    ],\n",
      "    \"MPAA film rating\": [\n",
      "      \"PG-13\"\n",
      "    ],\n",
      "    \"award received\": [\n",
      "      \"Golden Raspberry Award for Worst Picture\"\n",
      "    ],\n",
      "    \"part of the series\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"FSK film rating\": [\n",
      "      \"FSK 12\"\n",
      "    ],\n",
      "    \"costume designer\": [\n",
      "      \"Deborah Lynn Scott\"\n",
      "    ],\n",
      "    \"production designer\": [\n",
      "      \"Nigel Phelps\"\n",
      "    ],\n",
      "    \"production company\": [\n",
      "      \"di Bonaventura Pictures\",\n",
      "      \"DreamWorks\",\n",
      "      \"Hasbro\"\n",
      "    ],\n",
      "    \"Filmiroda rating\": [\n",
      "      \"Category II\"\n",
      "    ],\n",
      "    \"instance of\": [\n",
      "      \"film\"\n",
      "    ],\n",
      "    \"director of photography\": [\n",
      "      \"Ben Seresin\"\n",
      "    ],\n",
      "    \"original language of film or TV show\": [\n",
      "      \"English\"\n",
      "    ],\n",
      "    \"JMK film rating\": [\n",
      "      \"free from 12 years\"\n",
      "    ],\n",
      "    \"distribution format\": [\n",
      "      \"video on demand\"\n",
      "    ],\n",
      "    \"color\": [\n",
      "      \"color\"\n",
      "    ],\n",
      "    \"country of origin\": [\n",
      "      \"United States of America\"\n",
      "    ],\n",
      "    \"derivative work\": [\n",
      "      \"Transformers: Revenge of the Fallen (video game)\"\n",
      "    ],\n",
      "    \"assessment\": [\n",
      "      \"reverse Bechdel Test\",\n",
      "      \"Bechdel test\"\n",
      "    ],\n",
      "    \"director\": [\n",
      "      \"Michael Bay\"\n",
      "    ],\n",
      "    \"screenwriter\": [\n",
      "      \"Alex Kurtzman\",\n",
      "      \"Roberto Orci\",\n",
      "      \"Ehren Kruger\"\n",
      "    ],\n",
      "    \"Medierådet rating\": [\n",
      "      \"For ages 11 and up\"\n",
      "    ],\n",
      "    \"voice actor\": [\n",
      "      \"Grey Griffin\",\n",
      "      \"Frank Welker\",\n",
      "      \"Tom Kenny\",\n",
      "      \"Tony Todd\",\n",
      "      \"Hugo Weaving\",\n",
      "      \"Peter Cullen\"\n",
      "    ],\n",
      "    \"distributed by\": [\n",
      "      \"UIP-Dunafilm\",\n",
      "      \"FandangoNow\",\n",
      "      \"Netflix\"\n",
      "    ],\n",
      "    \"narrative location\": [\n",
      "      \"New York City\",\n",
      "      \"Washington, D.C.\",\n",
      "      \"Los Angeles\",\n",
      "      \"Paris\"\n",
      "    ],\n",
      "    \"filming location\": [\n",
      "      \"Philadelphia\",\n",
      "      \"New Jersey\",\n",
      "      \"New Mexico\",\n",
      "      \"San Diego\",\n",
      "      \"New York City\",\n",
      "      \"Los Angeles\",\n",
      "      \"Egypt\",\n",
      "      \"Arizona\",\n",
      "      \"Shanghai\",\n",
      "      \"Paris\",\n",
      "      \"California\"\n",
      "    ]\n",
      "  },\n",
      "  \"Q250378\": {\n",
      "    \"entity_name\": \"The Transformers: The Movie\",\n",
      "    \"genre\": [\n",
      "      \"action film\",\n",
      "      \"adventure film\",\n",
      "      \"science fiction film\",\n",
      "      \"super robot\"\n",
      "    ],\n",
      "    \"executive producer\": [\n",
      "      \"Lee Gunther\",\n",
      "      \"Margaret Loesch\"\n",
      "    ],\n",
      "    \"takes place in fictional universe\": [\n",
      "      \"Transformers universe\"\n",
      "    ],\n",
      "    \"based on\": [\n",
      "      \"Transformers\"\n",
      "    ],\n",
      "    \"FSK film rating\": [\n",
      "      \"FSK 12\"\n",
      "    ],\n",
      "    \"production company\": [\n",
      "      \"Sunbow Entertainment\",\n",
      "      \"Marvel Productions\",\n",
      "      \"Hasbro\",\n",
      "      \"Toei Animation\"\n",
      "    ],\n",
      "    \"instance of\": [\n",
      "      \"animated feature film\"\n",
      "    ],\n",
      "    \"original language of film or TV show\": [\n",
      "      \"English\",\n",
      "      \"Japanese\"\n",
      "    ],\n",
      "    \"language of work or name\": [\n",
      "      \"English\"\n",
      "    ],\n",
      "    \"distribution format\": [\n",
      "      \"video on demand\"\n",
      "    ],\n",
      "    \"color\": [\n",
      "      \"color\"\n",
      "    ],\n",
      "    \"country of origin\": [\n",
      "      \"United States of America\"\n",
      "    ],\n",
      "    \"assessment\": [\n",
      "      \"Bechdel test\"\n",
      "    ],\n",
      "    \"director\": [\n",
      "      \"Nelson Shin\",\n",
      "      \"Margaret Nichols\"\n",
      "    ],\n",
      "    \"screenwriter\": [\n",
      "      \"Ron Friedman\"\n",
      "    ],\n",
      "    \"voice actor\": [\n",
      "      \"John Moschitta, Jr.\",\n",
      "      \"Leonard Nimoy\",\n",
      "      \"Eric Idle\",\n",
      "      \"Orson Welles\",\n",
      "      \"Robert Stack\",\n",
      "      \"Judd Nelson\",\n",
      "      \"Lionel Stander\"\n",
      "    ],\n",
      "    \"distributed by\": [\n",
      "      \"De Laurentiis Entertainment Group\",\n",
      "      \"Netflix\"\n",
      "    ]\n",
      "  }\n",
      "}\n"
     ]
    }
   ],
   "execution_count": 144
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:31:15.848661Z",
     "start_time": "2024-10-10T19:31:02.140667Z"
    }
   },
   "cell_type": "code",
   "source": "professional_to_predicate(\"Hans Zimmer\")",
   "id": "ead746a1454bf9e9",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\n",
      "  \"Q76364\": {\n",
      "    \"entity_name\": \"Hans Zimmer\",\n",
      "    \"native language\": [\n",
      "      \"German\"\n",
      "    ],\n",
      "    \"occupation\": [\n",
      "      \"musician\"\n",
      "    ],\n",
      "    \"described by source\": [\n",
      "      \"Obalky knih.cz\"\n",
      "    ],\n",
      "    \"religion\": [\n",
      "      \"Christianity\"\n",
      "    ],\n",
      "    \"nominated for\": [\n",
      "      \"Academy Award for Best Original Musical or Comedy Score\",\n",
      "      \"Academy Award for Best Original Dramatic Score\",\n",
      "      \"Academy Award for Best Original Score\"\n",
      "    ],\n",
      "    \"languages spoken, written or signed\": [\n",
      "      \"German\"\n",
      "    ],\n",
      "    \"award received\": [\n",
      "      \"Stephen Hawking Medal For Science Communication\",\n",
      "      \"Academy Award for Best Original Score\"\n",
      "    ],\n",
      "    \"place of birth\": [\n",
      "      \"Frankfurt am Main\"\n",
      "    ],\n",
      "    \"country of citizenship\": [\n",
      "      \"Germany\"\n",
      "    ],\n",
      "    \"instance of\": [\n",
      "      \"human\"\n",
      "    ],\n",
      "    \"work location\": [\n",
      "      \"Los Angeles\"\n",
      "    ]\n",
      "  }\n",
      "}\n"
     ]
    }
   ],
   "execution_count": 145
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:31:25.368212Z",
     "start_time": "2024-10-10T19:31:15.864989Z"
    }
   },
   "cell_type": "code",
   "source": "get_imdb_id_by_name(\"Brad Pitt\")",
   "id": "6f03f751b8bb5fc8",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[['nm0000093', 'http://www.wikidata.org/entity/Q35332']]\n"
     ]
    }
   ],
   "execution_count": 146
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-10-10T19:31:25.439057Z",
     "start_time": "2024-10-10T19:31:25.386773Z"
    }
   },
   "cell_type": "code",
   "source": [
    "with open(\"exports/film_db.json\", \"r\", encoding=\"utf-8\") as file:\n",
    "    film_dict = json.load(file)\n",
    "with open(\"exports/actors_db.json\", \"r\", encoding=\"utf-8\") as file:\n",
    "    actor_dict = json.load(file)\n",
    "with open(\"exports/professionals_db.json\", \"r\", encoding=\"utf-8\") as file:\n",
    "    professional_dict = json.load(file)"
   ],
   "id": "67c51e3ca68f4dac",
   "outputs": [],
   "execution_count": 147
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
